<HTML>
<HEAD>
<TITLE>Algoritmos Gen&eacute;ticos</TITLE>
<STYLE TYPE="TEXT/CSS">
BODY,TD {
	font-family: arial,helvetica,sans-serif;
	font-size: 11pt;
}
SMALL {
	font-family: arial,helvetica,sans-serif;
	font-size: 8pt;
	color: gray;
}
</STYLE>
</HEAD>
<BODY BGCOLOR="WHITE" >

<!-- page below here -->

Nesta p&aacute;gina listaremos os links. Originalmente, estes links refletem o apêndice A do livro,
mas como prometido, estas p&aacute;ginas ficar&atilde;o em permanente constru&ccedil;&atilde;o. Logo, pretendo
increment&aacute;-las bastante ao longo do tempo. <p>

&eacute; importante entender que a Internet &eacute; um mundo em constante muta&ccedil;&atilde;o. Logo, alguns destes
sites podem ter sa&iacute;do do ar quando você acess&aacute;-los. Se você descobrir algum novo site
interessante ou que algum dos endere&ccedil;os colocados aqui n&atilde;o s&atilde;o mais corretos, eu terei
prazer em receber suas sugest&otilde;es <A href="mailto:rlinden@pobox.com">por e-mail</A>. <p>

<hr>

<FONT SIZE=+1>1) Sites</FONT> <p>

Como quase sempre, quando queremos buscar informa&ccedil;&otilde;es na Internet, podemos come&ccedil;ar
procurando na WikiPedia. Este projeto mant&eacute;m uma p&aacute;gina interessante sobre
<A HREF=http://en.wikipedia.org/wiki/Genetic_algorithm>algoritmos gen&eacute;ticos</A>,
no qual existem informa&ccedil;&otilde;es interessantes, links para outros sites com boas informa&ccedil;&otilde;es
e para informa&ccedil;&otilde;es complementares sobre conceitos nos quais os GAs se baseiam. <p>

Nenhuma referência a material p&uacute;blico sobre algoritmos gen&eacute;ticos poderia estar completa
sem mencionar o <A HREF=http://www.geocities.com/francorbusetti/gafaq.pdf>“Hitchhiker’s Guide to Evolutionary Computation”</A>,
(formato de arquivo para Acrobat Reader) e <A HREF=ftp://ftp.cerias.purdue.edu/pub/doc/EC/Welcome.html>seu apêndice</A>. 
O guia surgiu inicialmente como um guia para o newsgroup <I>comp.ai.genetic</I>, mas que 
cresceu de forma espantosa (a &uacute;ltima vers&atilde;o acessada j&aacute; tinha 116 p&aacute;ginas). Ele &eacute; organizado
em forma de perguntas e respostas e sua (falta de) organiza&ccedil;&atilde;o reflete o fato de ter m&uacute;ltiplos
autores. Entretanto, &eacute; muito prov&aacute;vel que a resposta para alguma pergunta que você tenha
(ou pelo menos uma dica de onde encontr&aacute;-la) seja encontrado no guia.

Existem v&aacute;rios sites que coontêm informa&ccedil;&otilde;es interessantes sobre algoritmos gen&eacute;ticos.
Dois que podemos destacar s&atilde;o:

<UL>
<LI><A HREF=http://cs.felk.cvut.cz/~xobitko/ga/>O primeiro deles</A> cont&eacute;m um texto introdut&oacute;rio
     b&aacute;sico, que vai acrescentar pouco. Entretanto, possui applets que funcionam
     perfeitamente no Internet Explorer e que lhe permitem visualizar graficamente o 
     desenvolvimento da popula&ccedil;&atilde;o de um GA que busca resolver um problema de otimiza&ccedil;&atilde;o de
     uma fun&ccedil;&atilde;o multi-modal.
<LI><A HREF=http://www.rennard.org/alife/english/gavintrgb.html>O outro site</A> cont&eacute;m um
     texto b&aacute;sico, mas que cont&eacute;m uma applet na qual podemos ver em tempo real a evolu&ccedil;&atilde;o
     de uma popula&ccedil;&atilde;o. No caso deste site, a evolu&ccedil;&atilde;o &eacute; de estruturas que s&atilde;o codificadas
     de forma tradicional, mas que s&atilde;o desenhadas graficamente, dando uma roupagem
     interessante ao problema. Este site inclusive permite que se fa&ccedil;a o download do
     c&oacute;digo fonte da applet, o que &eacute; uma excelente maneira de se aprender um pouco mais
     sobre GAs.
</UL>

<p>
Como neste livro mencionamos outras &aacute;reas da computa&ccedil;&atilde;o evolucion&aacute;ria, você pode ter ficado
interessado em uma delas.  Como sempre a internet &eacute; uma fonte valiosa de recursos e muitas
informa&ccedil;&otilde;es podem ser encontradas nos seguintes sites:
<UL>
<LI> <A HREF=http://www.genetic-programming.org>Site organizado pelo “papa” da programa&ccedil;&atilde;o gen&eacute;tica</A>,
     John Koza, que cont&eacute;m muita informa&ccedil;&atilde;o interessante, incluindo um cap&iacute;tulo do
     seu livro (que &eacute; mencionado na nossa bibliografia), teses de doutorado, artigos,
     tutoriais e outras informa&ccedil;&otilde;es interesantes.
</UL>
<p>
<hr>
<br>
<FONT SIZE=+1>2) Comunica&ccedil;&atilde;o com a Comunidade</FONT><p>

Um dos grandes mecanismos de comunica&ccedil;&atilde;o com a comunidade de algoritmos gen&eacute;ticos &eacute; o
EC-Digest (antigo GAList), que &eacute; um bom lugar para se ver chamadas de congressos,
pedir ajuda ou at&eacute; auxiliar ao pr&oacute;ximo (agora que vocês j&aacute; est&atilde;o extremamente proficientes
na &aacute;rea de algoritmos gen&eacute;ticos). A mudan&ccedil;a de nome da lista decorre da altera&ccedil;&atilde;o de
paradigma do conte&uacute;do. Antigamente, nesta lista, s&oacute; se falava de algoritmos gen&eacute;ticos.
Entretanto, hoje ela evoluiu e l&aacute; se fala de programa&ccedil;&atilde;o gen&eacute;tica, estrat&eacute;gias evolucion&aacute;rias
e todos os temas ligados &agrave; computa&ccedil;&atilde;o evolucion&aacute;ria como um todo.<p>

Para se inscrever nesta lista, mande um e-mail sem assunto para 
<A HREF="mailto:listserv@listserv.gmu.edu">este endere&ccedil;o</A> com o texto
subscribe EC-Digest-L <seu nome>. Logo ap&oacute;s você receber&aacute; um e-mail de confirma&ccedil;&atilde;o
contendo instru&ccedil;&otilde;es para se inscrever. Ap&oacute;s alguns minutos, você ser&aacute; parte da grande
comunidade mundial da computa&ccedil;&atilde;o evolucion&aacute;ria. <p>

<hr>
<br>


<FONT SIZE=+1>3) C&oacute;digo Fonte</FONT><p>

Existem v&aacute;rios sites que oferecem c&oacute;digo fonte de implementa&ccedil;&otilde;es de algoritmos gen&eacute;ticos.
<A HREF=http://www.aic.nrl.navy.mil/galist/src/>Um dos mais completos</A> mant&eacute;m uma listagem
de cerca de 50 aplicativos em v&aacute;rias linguagens diferentes (C, C++, Java, Eiffel, Fortran,
LISP e Matlab). As normas de utiliza&ccedil;&atilde;o dos c&oacute;digos disponibilizados est&atilde;o contidas
no pr&oacute;prio site e devem ser respeitadas, obviamente.<p>

<hr>
<br>

<FONT SIZE=+1>4) Produtos Comerciais</FONT><p>

N&atilde;o tenho nenhum interesse comercial em qualquer  dos produtos listados aqui (e em nenhum
outro existente). Logo, n&atilde;o considerem a presen&ccedil;a ou ausência de um produto nesta lista
como sendo uma recomenda&ccedil;&atilde;o da minha parte. A quantidade de aplicativos que usam GAs hoje
&eacute; t&atilde;o grande que seria imposs&iacute;vel fazer uma lista exaustiva de produtos dispon&iacute;veis no mercado. <p>

Os seguintes est&atilde;o dispon&iacute;veis para compra e/ou licenciamento de forma a conseguir
software com apoio profissional. &eacute; importante buscar, antes de se decidir por qualquer
um deles, ferramentas que sigam a filosofia <I>open source</I> ou n&atilde;o comerciais, que
listamos na pr&oacute;xima se&ccedil;&atilde;o, que podem eventualmente ser mais adequadas para sua empreitada. <p>

Entre os softwares existentes, podemos apontar:

<UL>
<LI>    <A HREF=http://www.palisade.com/evolver/>Evolver</A> 
<LI>   <A HREF=http://www.optiwater.com/optiga.html>OptiGA</A> 
<LI>   <A HREF=http://www.predictivedynamix.com/products.htm>Predictive Suite</A> 
<LI>   <A HREF=http://www.wardsystems.com/products.asp?p=genehunter>GeneHunter</A> 
<LI>   <A HREF=http://www.nd.com/genetic/>GeneticServer</A> 
<LI>   <A HREF=http://www.geatbx.com>Matlab</A> o Matlab, software que se tornou uma plataforma de excelência na 
        &aacute;rea de computa&ccedil;&atilde;o cient&iacute;fica, possui um pacote para utiliza&ccedil;&atilde;o de algoritmos
        gen&eacute;ticos, denominado GEATBX.

</UL>

<p>

<hr>
<br>


<FONT SIZE=+1>5) Produtos N&atilde;o Comerciais</FONT><p>

Existem dezenas de produtos n&atilde;o comerciais cujo c&oacute;digo fonte est&aacute; dispon&iacute;vel para uso.
Muitos s&atilde;o bem comentados, outros s&atilde;o bibliotecas de usos. Listamos a seguir uma rela&ccedil;&atilde;o
resumida, alguns dos quais foram originalmente referenciados em (Carvalho, 2003) e no 
FAQ intitulado “Hitchhiker's Guide to Evolutionary Computation”. <p> 

Os softwares s&atilde;o os seguintes:
<UL>
<LI>   <A HREF=http://eodev.sourceforge.net/>Evolutionary Objects</A> &eacute; uma biblioteca escrita em C++ criada pela
       equipe Geneura da Universidade de Granada que foi projetada para facilitar a 
       constru&ccedil;&atilde;o de algoritmos evolutiovos. O sistema roda em uma diversidade de
       ambientes, incluindo v&aacute;rios tipos de Linux e Windows 95/NT.
        Neste endere&ccedil;o tamb&eacute;m encontram-se links para um tutorial de uso, al&eacute;m de um paper
        e slides usados em uma conferência de 2001 onde o sistema foi apresentado.  
<LI>   <A HREF=http://lancet.mit.edu/ga>GALib</A> &eacute; uma biblioteca escrita em C++ que fornece um conjunto de
        objetos para o projeto de GAs. A documenta&ccedil;&atilde;o on-line e o c&oacute;digo fonte podem ser
        obtidos no link acima. Com GALib, &eacute; poss&iacute;vel utilizar v&aacute;rios tipos distintos de
        sele&ccedil;&atilde;o, crossover e muta&ccedil;&atilde;o em v&aacute;rias diferentes representa&ccedil;&otilde;es cromossomiais,
        al&eacute;m de usar diversos m&oacute;dulos de popula&ccedil;&atilde;o e crit&eacute;rios de parada distintos.
        Este software requer um compilador C++ e pode ser rodado em v&aacute;rios sistemas
        operacionais distintos, tais como v&aacute;rios sistemas Unix, Mac/OS e DOS/Windows.
<LI>   <A HREF=http://GARAGe.cps.msu.edu/>GALOPPS</A> o nome &eacute; um acrônimo para Genetic ALgorithm Optimized for Portability and Paralelism.
        &eacute; um sistema escrito na linguagem C que cria um GA baseado nos princ&iacute;pios do GA
        mais simples, descrito no cap&iacute;tulo 4 do nosso livro, e sua id&eacute;ia b&aacute;sica &eacute; criar
        um ambiente que os usu&aacute;rios possam ampliar e no qual eles possam aprender.
        Para us&aacute;-lo, o usu&aacute;rio deve definir uma fun&ccedil;&atilde;o de avalia&ccedil;&atilde;o e quaisquer outras
        fun&ccedil;&otilde;es necess&aacute;rias, usando templates definidos pelo sistema. Pode rodar em uma ou
        mais sub-esta&ccedil;&otilde;es, possuindo um modo batch ou um modo gr&aacute;fico para maior intera&ccedil;&atilde;o
        com o usu&aacute;rio. No link onde podem ser obtidas a vers&atilde;o Unix, a vers&atilde;o Windows,
        um guia do usu&aacute;rio e uma vers&atilde;o voltada para o uso de threads, adequada para
        execu&ccedil;&atilde;o paralela. Este sistema paralelo usa o esquema “island”, descrito na se&ccedil;&atilde;o
        16.3 e pode ser utilizado em um &uacute;nico computador pessoal ou v&aacute;rios computadores
        em rede. O sistema j&aacute; foi testado nos ambientes DOS, Windows, NeXTStep, SunOS, Solaris,
        HP-UX, Metrowerks Macintosh. 
<LI>   <A HREF=http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/areas/genetic/ga/systems/gannet/0.html>GANNET</A> 
        GANNET (Genetic Algorithm / Neural NETwork) &eacute; um pacote de software escrito por
        Jason Spofford em 1990 que permite evoluir redes neurais bin&aacute;rias pequenas, de
        forma a construir um modelo educacional do que foi discutido no cap&iacute;tulo 11.
        Apesar de ser relativamente antigo, ele &eacute; interessante pois permite avaliar as
        redes sobre v&aacute;rios crit&eacute;rios diferentes de forma relativamente f&aacute;cil.
<LI>   <A HREF=http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/areas/genetic/ga/systems/genesis/0.html>Genesis e variantes</A> 
        Genesis &eacute; um GA baseado em gera&ccedil;&otilde;es escrito em C por John Grefenstette. Como foi um
        dos primeiros pacotes distribu&iacute;do de forma gratuita e extensa, o Genesis foi muito
        influente na populariza&ccedil;&atilde;o dos algoritmos gen&eacute;ticos e v&aacute;rios pacotes dispon&iacute;veis
        atualmente s&atilde;o baseados nele. O <A HREF=http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/areas/genetic/ga/systems/dgenesis/0.html .O pGA &eacute; uma vers&atilde;o paralela do Genesis que permite m&uacute;ltiplas popula&ccedil;&otilde;es com taxa peri&oacute;dica de migra&ccedil;&atilde;o e v&aacute;rias outras op&ccedil;&otilde;es, e pode ser obtido no endere&ccedil;o da internet  http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/areas/genetic/ga/systems/pga/0.html>
        DGenesis</A> &eacute; uma implementa&ccedil;&atilde;o distribu&iacute;da baseada na
        vers&atilde;o 5.0 do Genesis para ser implementada em uma rede de workstations, onde cada
        sub-popula&ccedil;&atilde;o &eacute; mantida como uma thread, e todas se comunicam usando sockets.
        &eacute; programado na linguagem C e pode ser utilizado em esta&ccedil;&otilde;es de trabalho Unix.
<LI>   <A HREF=http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/areas/genetic/ga/systems/genet/0.html>GenET</A> 
        &eacute; um pacote gen&eacute;rico para GAs, no sentido de que mecanismos
        independentes de problema foram implementados e podem ser usados n&atilde;o importando o
        dom&iacute;nio da aplica&ccedil;&atilde;o. O pacote permite m&uacute;ltiplas representa&ccedil;&otilde;es cromossomiais distintas, al&eacute;m
        de m&uacute;ltiplos operadores para cada representa&ccedil;&atilde;o. O GA foi implementado oferecendo
        uma ampla gama de possibilidades de parametriza&ccedil;&atilde;o, como por exemplo no caso do
        m&oacute;dulo de popula&ccedil;&atilde;o, que suporta modelos que incluem um baseado em gera&ccedil;&otilde;es, um
        <I>steady-state</I> e at&eacute; mesmo outros, mais avan&ccedil;ados. Foi implementado em C++.
<LI>   <A HREF=http://www.aridolan.com/ga/gaa/gaa.html>GA Playground</A> The GA Playground &eacute; um pacote de ferramentas de prop&oacute;sito
        geral no qual o usu&aacute;rio pode definir e rodar seus pr&oacute;prios problemas de otimiza&ccedil;&atilde;o.
        Foi implementado na linguagem Java e requer um compilador Java, al&eacute;m da JVM instalada
        no computador que vai execut&aacute;-lo. Para resolver seu problema particular, o usu&aacute;rio
        s&oacute; precisa modificar um arquivo denominado GaaFunction, onde se codificar&aacute;,
        em Java, sua fun&ccedil;&atilde;o de avalia&ccedil;&atilde;o.
</uL>
<p>

<hr>
<br>


<FONT SIZE=+1>6) Revistas e Peri&oacute;dicos</FONT><p>

Seguem abaixo alguns dos principais peri&oacute;dicos e revistas dispon&iacute;veis no meio cient&iacute;fico
para que você possa se manter a par das novas pesquisas na &aacute;rea de algoritmos gen&eacute;ticos.
Novamente, a presen&ccedil;a ou ausência de um peri&oacute;dico nesta lista n&atilde;o &eacute; indicativo de qualidade,
posto que a listagem n&atilde;o &eacute;, de maneira nenhuma, exaustiva. Ademais os peri&oacute;dicos descritos
nesta se&ccedil;&atilde;o publicam artigos decorrentes de pesquisas novas e, geralmente, inovadoras, o
que pode fazer com que sejam leitura extremamente dif&iacute;cil para um iniciante na &aacute;rea.

<UL>
<LI><A HREF="http://www.mitpressjournals.org/loi/evco?cookieSet=1">Evolutionary Computation</A>: cont&eacute;m artigos que descrevem v&aacute;rias &aacute;reas de modelos
    inspirados em sistemas naturais, com especial ênfase em sistemas evolution&aacute;rios,
    tais como algoritmos gen&eacute;ticos e estrat&eacute;gias evolucion&aacute;rias.
<LI><A HREF="http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4235">IEEE Transactions on Evolutionary Computation</A>: tem como objetivo publicar artigos de 
    computa&ccedil;&atilde;o evolucion&aacute;ria e &aacute;reas correlatas com ênfase nas aplica&ccedil;&otilde;es pr&aacute;ticas para
    resolu&ccedil;&atilde;o de problemas na ind&uacute;stria, medicina e outras disciplinas. D&aacute; preferência a
    artigos sobre algoritmos gen&eacute;ticos, estrat&eacute;gias evolucion&aacute;rias e programa&ccedil;&atilde;o gen&eacute;tica,
    entre outras.
<LI><A HREF="http://www.elsevier.com/wps/find/journaldescription.cws_home/506017/description#description">BioSystems</A>: publica artigos que ligam a inform&aacute;tica &agrave; biologia e ao pensamento
    evolucion&aacute;rio. Suas &aacute;reas de interesse s&atilde;o amplas e incluem desde modelagem de
    sistemas biol&oacute;gicos complexos at&eacute; modelos evolucion&aacute;rios da computa&ccedil;&atilde;o.
<LI><A HREF="http://www.springerlink.com/content/1573-0565/">Machine Learning</A>: &eacute; uma revista que congrega todas as diferentes abordagens do
    aprendizado de m&aacute;quina. Publica artigos em teoria do aprendizado ou na aplica&ccedil;&atilde;o de
    diferentes m&eacute;todos de aprendizado, entre os quais os GAs, aplicados a v&aacute;rias &aacute;reas de
    aplica&ccedil;&atilde;o distintas.
</UL>

Estes peri&oacute;dicos, assim como muitos outros, est&atilde;o dispon&iacute;veis no excelente
<a href="http://periodicos.capes.gov.br/portugues/index.jsp">Portal de Peri&oacute;dicos</a>
da <A HREF="http://www.capes.gov.br/">CAPES</A>.

<p>

<hr>
<br>


<FONT SIZE=+1>7) Conferências</FONT><p>

Na d&eacute;cada de 80, o progresso dos algoritmos evolucion&aacute;rios e sua populariza&ccedil;&atilde;o no meio
cient&iacute;fico fizeram com que surgissem as primeiras conferências dedicadas exclusivamente a estes t&oacute;picos.
Em termos internacionais, podemos destacar alguns eventos, listados em (Eiben 2003):<p>

<UL>
<LI>Em 1985 surgiu a International Conference on Genetic Algorithms (1985), uma conferência bienal, que, em 1999, fundiu-se com a Annual Conference on Genetic Programming e formou um dos mais prestigiados eventos da comunidade, a Genetic and Evolutionary Computation Conference (GECCO). 
<LI>Em 1992 surgiu a Annual Conference on Evolutionary Programming que se fundiu com a IEEE Conference on Evolutionary Computation e se tornou o Congress on Evolutionary Computation (CEC), evento que ainda mant&eacute;m seu car&aacute;ter anual.
<LI>Na Europa surgiu, em 1990, a conferência intitulada Parallel Problem Solving from Nature (PPSN), que desde ent&atilde;o mant&eacute;m seu car&aacute;ter bienal.
<LI>Existe tamb&eacute;m uma conferência dedicada apenas aos aspectos te&oacute;ricos de algoritmos gen&eacute;ticos, intitulada Foundations of Genetic Algoirhtms (FOGA), que tamb&eacute;m &eacute; bienal.
<LI>International Joint Conference on Artificial Intelligence (IJCAI) &eacute; um encontro realizado de forma biannual que &eacute; organizado  de forma independente mas com o apoio das sociedades de inteligência artificial dos pa&iacute;ses sedes. &eacute; uma conferência de v&aacute;rios temas de IA, n&atilde;o s&oacute; de algoritmos evolucion&aacute;rios, e, consequentemente, pode conter poucos artigos sobre o assunto.
</UL>
<p>

Existem tamb&eacute;m eventos nacionais que, apesar de n&atilde;o serem dedicados &uacute;nica e exclusivamente
aos algoritmos evolucion&aacute;rios, d&atilde;o a esta &aacute;rea um grande destaque. Entre eles podemos
destacar:<p>
<UL>
<LI>Simp&oacute;sio Brasileiro de Inteligência Artificial (SBIA), que &eacute; um evento bienal, que em 2004 chegou &agrave; sua 17ª. Edu&ccedil;&atilde;o e que busca ser o forum principal da comunidade de inteligência artificial no Brasil, incluindo nestes os pesquisadores na &aacute;rea de algoritmos evolucion&aacute;rios. Desde os anos 90 o SBIA tem atra&iacute;do pesquisadores de todo o mundo e hoje em dia possui um comitê de programa internacional, al&eacute;m de ter v&aacute;rios estrangeiros nas posi&ccedil;&otilde;es de palestrantes principais.
<LI>Workshop Brasileiro de Teses e Disserta&ccedil;&otilde;es em Inteligência Artificial (WTDIA), evento bienal e em 2004 realizou sua segunda edi&ccedil;&atilde;o. Como seu pr&oacute;prio site oficial afirma, o WTDIA tem como objetivo principal a existência de um forum de discuss&atilde;o para os trabalhos de tese e disserta&ccedil;&otilde;es em Inteligência Artificial, promovendo a integra&ccedil;&atilde;o e coopera&ccedil;&atilde;o dos pesquisadores nesta &aacute;rea e propiciando maior visibilidade dos trabalhos em andamento para a comunidade acadêmica e industrial. Pretende ainda propiciar maior participa&ccedil;&atilde;o de alunos de p&oacute;s-gradua&ccedil;&atilde;o no evento, e estimular a melhoria da qualidade dos trabalhos de teses de Doutorado e de disserta&ccedil;&otilde;es de Mestrado da &aacute;rea de Inteligência Artificial
<LI>Simp&oacute;sio Brasileiro de Automa&ccedil;&atilde;o Inteligente (SBAI), que &eacute; um evento bianual, promovido pela Sociedade Brasileira de Autom&aacute;tica, reunindo pesquisadores da &aacute;rea de automa&ccedil;&atilde;o que utilizam t&eacute;cnicas de inteligência artificial e &aacute;reas correlatas. V&aacute;rias aplica&ccedil;&otilde;es interessantes de algoritmos evolucion&aacute;rios e outras t&eacute;cnicas computacionais podem ser vistas neste evento.
</UL>
<p>

&eacute; importante ressaltar que nenhum dos eventos nacionais &eacute; dedicado exclusivamente a
algoritmos evolucion&aacute;rios e &eacute; poss&iacute;vel que, em alguma edi&ccedil;&atilde;o, haja muitos poucos artigos
ligados a EA. Entretanto, pelo seu car&aacute;ter cient&iacute;fico e tecnol&oacute;gico, estes s&atilde;o eventos
que sempre interessar&atilde;o a uma pessoa verdadeiramente dedicada &agrave; &aacute;rea.

<p>

<hr>
<br>

<FONT SIZE=+1>8) Informa&ccedil;&otilde;es biol&oacute;gicas</FONT><p>

No cap&iacute;tulo 2 n&oacute;s tentamos oferecer uma introdu&ccedil;&atilde;o simples e compacta sobre os conceitos
biol&oacute;gicos usados como inspira&ccedil;&atilde;o dos algoritmos gen&eacute;ticos. Devido ao fato do p&uacute;blico alvo
deste livro ser composto de informatas, e n&atilde;o bi&oacute;logos, esta se&ccedil;&atilde;o ficou bastante
incompleta. Assim, listamos aqui alguns sites que podem ajudar &agrave;queles que queiram
complementar estas informa&ccedil;&otilde;es.<p>

Para compreender bem a teoria da evolu&ccedil;&atilde;o, o surgimento da vida e at&eacute; mesmo algumas
teorias contr&aacute;rias &agrave; de Darwin, um bom site para &eacute; <A HREF=http://www.universitario.com.br/celo/topicos/subtopicos/evolucao/teorias/teorias.html>este aqui</A>.
Outro site que pode lhe ajudar bastante &eacute; <A HREF=http://www.xr.pro.br/teoria_evolucao.html>
este</A>. 
	
Para entender melhor a hist&oacute;ria do descobrimento do DNA, sua fun&ccedil;&atilde;o e como ele se relaciona
com as prote&iacute;nas, um excelente site &eacute; <A HREF=http://www.ime.usp.br/~cesar/projects/lowtech/setemaiores/dna.htm>este aqui</A>,
fonte inclusive de parte da informa&ccedil;&atilde;o listada no cap&iacute;tulo 2. <p>

A Wikipedia, sempre uma fonte interessante de subs&iacute;dios, pode lhe fornecer informa&ccedil;&atilde;o
sobre os cromossomos, no site de endere&ccedil;o dado <A HREF=http://pt.wikipedia.org/wiki/Cromossoma>aqui</A>. <p>

A sua compreens&atilde;o sobre o DNA e o dogma central pode ser ampliada atrav&eacute;s da informa&ccedil;&atilde;o
contida <A HREF=http://web.mit.edu/esgbio/www/dogma/dogmadirnew.html>neste site</A>. 
L&aacute; tamb&eacute;m est&atilde;o armazenadas informa&ccedil;&otilde;es sobre o RNA, muta&ccedil;&otilde;es e outros conceitos
biol&oacute;gicos interessantes. <p>

Outro ponto importante &eacute; a associa&ccedil;&atilde;o entre gen&oacute;tipo e fen&oacute;tipo. Algumas informa&ccedil;&otilde;es
interessantes podem ser encontradas <A HREF=http://www.monografias.com/trabajos13/heram/heram.shtml> aqui</A>  e, como sempre, 
na Wikipedia, <A HREF=http://pt.wikipedia.org/wiki/Fen%C3%B3tipo>neste endere&ccedil;o</A> e
<A HREF=http://pt.wikipedia.org/wiki/Gen%C3%B3tipo>neste</A>.  <p>

Estes sites s&atilde;o apenas uma sugest&atilde;o para uma introdu&ccedil;&atilde;o r&aacute;pida. Muitos outros existem,
em todos os n&iacute;veis imagin&aacute;veis de profundidade. Use as capacidades do seu buscador
favorito para encontrar muito mais informa&ccedil;&atilde;o dispon&iacute;vel na internet.


<!-- page above here -->

<hr>
<p>&nbsp;</p>


<!-- This message may not be removed! -->
<A HREF="http://www.weballey.net/"><small>Template provided by WEBalley</small></A><br>
<A HREF="http://www.weballey.net/"><img SRC="weballey.jpg" BORDER="0" width="80" height="30"></A>
<!-- This message may not be removed! -->


</BODY>
</HTML>
